Gieneq/Audio-Spectrum-Display-ESP32S3/main/source/wired.c
#include "sources.h"
#include <stdlib.h>
#include <math.h>
#include <time.h>
#include <string.h>
#include <assert.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/timers.h"
#include "freertos/event_groups.h"
#include "esp_adc/adc_continuous.h"
// #include "driver/i2s_std.h"
#include "driver/gpio.h"
#include "esp_log.h"
#include "../gtypes.h"
#include "esp_timer.h"
#include "soc/soc_caps.h"

// #define EXAMPLE_BUFF_SIZE               2048

// #define ADC_EXTERNAL_I2S_BCLK_PIN       GPIO_NUM_39
// #define ADC_EXTERNAL_I2S_LRCK_PIN       GPIO_NUM_40
// #define ADC_EXTERNAL_I2S_DOUT_PIN       GPIO_NUM_41

static const char *TAG = "SOURCE_WIRED";
// CONFIG_ADC_CONTINUOUS_FORCE_USE_ADC2_ON_C3_S3

//https://www.espressif.com/sites/default/files/documentation/esp32-s3_technical_reference_manual_en.pdf
// Page 1468
// Note
// ADC2 CH0 -> GPIO11 (LEFT IN)
// ADC2 CH1 -> GPIO12
// ADC2 CH2 -> GPIO13 (RIGHT IN)

// ADC1 CH8 -> GPIO9
// ADC1 CH0 -> GPIO1 (buttons)


// static input_samples_window_t input_samples_window;
#define EXAMPLE_ADC_UNIT                    ADC_UNIT_1
#define _EXAMPLE_ADC_UNIT_STR(unit)         #unit
#define EXAMPLE_ADC_UNIT_STR(unit)          _EXAMPLE_ADC_UNIT_STR(unit)
#define EXAMPLE_ADC_CONV_MODE               ADC_CONV_SINGLE_UNIT_1
#define EXAMPLE_ADC_ATTEN                   ADC_ATTEN_DB_11
#define EXAMPLE_ADC_BIT_WIDTH               SOC_ADC_DIGI_MAX_BITWIDTH

#if CONFIG_IDF_TARGET_ESP32S3
#define EXAMPLE_ADC_OUTPUT_TYPE             ADC_DIGI_OUTPUT_FORMAT_TYPE2
#define EXAMPLE_ADC_GET_CHANNEL(p_data)     ((p_data)->type2.channel)
#define EXAMPLE_ADC_GET_DATA(p_data)        ((p_data)->type2.data)
#endif

#define EXAMPLE_READ_LEN                    16

static adc_channel_t channel[2] = {ADC_CHANNEL_0, ADC_CHANNEL_8};

static TaskHandle_t s_task_handle;

static int64_t adc_done_last_time_us;
static int64_t adc_done_recent_time_us;
static int64_t adc_done_interval_us;

static void continuous_adc_init(adc_channel_t *channel, uint8_t channel_num, adc_continuous_handle_t *out_handle) {
    adc_continuous_handle_t handle = NULL;

    adc_continuous_handle_cfg_t adc_config = {
        .max_store_buf_size = 4*1024,
        .conv_frame_size = EXAMPLE_READ_LEN,
    };
    ESP_ERROR_CHECK(adc_continuous_new_handle(&adc_config, &handle));

    adc_continuous_config_t dig_cfg = {
        .sample_freq_hz = 50 * 1000,
        .conv_mode = EXAMPLE_ADC_CONV_MODE,
        .format = EXAMPLE_ADC_OUTPUT_TYPE,
    };

    adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = {0};
    dig_cfg.pattern_num = channel_num;
    for (int i = 0; i < channel_num; i++) {
        adc_pattern[i].atten = EXAMPLE_ADC_ATTEN;
        adc_pattern[i].channel = channel[i] & 0x7;
        adc_pattern[i].unit = EXAMPLE_ADC_UNIT;
        adc_pattern[i].bit_width = EXAMPLE_ADC_BIT_WIDTH;

        ESP_LOGI(TAG, "adc_pattern[%d].atten is :%"PRIx8, i, adc_pattern[i].atten);
        ESP_LOGI(TAG, "adc_pattern[%d].channel is :%"PRIx8, i, adc_pattern[i].channel);
        ESP_LOGI(TAG, "adc_pattern[%d].unit is :%"PRIx8, i, adc_pattern[i].unit);
    }
    dig_cfg.adc_pattern = adc_pattern;
    ESP_ERROR_CHECK(adc_continuous_config(handle, &dig_cfg));

    *out_handle = handle;
}





static void source_wired_task(void* params) {
    ESP_LOGI(TAG, "Start task");

    esp_err_t ret;
    uint32_t ret_num = 0;
    uint8_t result[EXAMPLE_READ_LEN] = {0};
    memset(result, 0xcc, EXAMPLE_READ_LEN);

    assert(CONFIG_ADC_CONTINUOUS_FORCE_USE_ADC2_ON_C3_S3 == 1);

//     gpio_reset_pin(GPIO_NUM_1);
// gpio_set_direction(GPIO_NUM_1, GPIO_MODE_INPUT);

    adc_continuous_handle_t handle = NULL;
    continuous_adc_init(channel, sizeof(channel) / sizeof(adc_channel_t), &handle);

    ESP_ERROR_CHECK(adc_continuous_start(handle));

    int loop_idx = 0;
    int64_t last_time_us = esp_timer_get_time();
    int64_t interval_us = 0;

    while (1) {
        char unit[] = EXAMPLE_ADC_UNIT_STR(EXAMPLE_ADC_UNIT);

        ret = adc_continuous_read(handle, result, EXAMPLE_READ_LEN, &ret_num, 100);
        if (ret == ESP_OK) {
            const int64_t this_time_us = esp_timer_get_time();
            interval_us = this_time_us - last_time_us;
            last_time_us = this_time_us;

            loop_idx += 1;
            if (loop_idx > 0) {
                loop_idx = 0;
                ESP_LOGI("TASK", "ret is %x, ret_num is %"PRIu32" bytes, (interval %lld us, done: %lld us)", ret, ret_num, interval_us, adc_done_interval_us);
                for (int i = 0; i < ret_num; i += SOC_ADC_DIGI_RESULT_BYTES) {
                    adc_digi_output_data_t *p = (void*)&result[i];
                    uint32_t chan_num = EXAMPLE_ADC_GET_CHANNEL(p);
                    uint32_t data = EXAMPLE_ADC_GET_DATA(p);
                    /* Check the channel number validation, the data is invalid if the channel num exceed the maximum channel */
                    if (i < 800) {
                        if (chan_num < SOC_ADC_CHANNEL_NUM(EXAMPLE_ADC_UNIT)) {
                            ESP_LOGI(TAG, "  -  Unit: %s, Channel: %"PRIu32", Value: %"PRIx32, unit, chan_num, data);
                        } else {
                            ESP_LOGW(TAG, "  -  Invalid data [%s_%"PRIu32"_%"PRIx32"]", unit, chan_num, data);
                        }
                    }
                }
            }
            /**
             * Because printing is slow, so every time you call `ulTaskNotifyTake`, it will immediately return.
             * To avoid a task watchdog timeout, add a delay here. When you replace the way you process the data,
             * usually you don't need this delay (as this task will block for a while).
             */
            // vTaskDelay(1);
        }
    }
    vTaskDelete(NULL);
}

esp_err_t source_wired_init() {
    xTaskCreate(source_wired_task, "source_wired_task", 7 * 1024, NULL, 4, NULL);
    
    return ESP_OK;
}

const input_samples_window_t* source_wired_await_input_samples_window(TickType_t timeout_tick_time) {
    vTaskDelay(10);
    return NULL;
}











// static adc_channel_t channel[2] = {ADC_CHANNEL_0, ADC_CHANNEL_2};



// static bool IRAM_ATTR s_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data) {
//     BaseType_t mustYield = pdFALSE;
//     adc_done_last_time_us = adc_done_recent_time_us;
//     adc_done_recent_time_us = esp_timer_get_time();
//     adc_done_interval_us = adc_done_recent_time_us - adc_done_last_time_us;
//     //Notify that ADC continuous driver has done enough number of conversions
//     vTaskNotifyGiveFromISR(s_task_handle, &mustYield);

//     return (mustYield == pdTRUE);
// }


// static void source_wired_task(void* params) {
//     ESP_LOGI(TAG, "Start task");

//     esp_err_t ret;
//     uint32_t ret_num = 0;
//     uint8_t result[EXAMPLE_READ_LEN] = {0};
//     memset(result, 0xcc, EXAMPLE_READ_LEN);

//     s_task_handle = xTaskGetCurrentTaskHandle();

//     assert(CONFIG_ADC_CONTINUOUS_FORCE_USE_ADC2_ON_C3_S3 == 1);

//     adc_continuous_handle_t handle = NULL;
//     continuous_adc_init(channel, sizeof(channel) / sizeof(adc_channel_t), &handle);

//     adc_continuous_evt_cbs_t cbs = {
//         .on_conv_done = s_conv_done_cb,
//     };
//     ESP_ERROR_CHECK(adc_continuous_register_event_callbacks(handle, &cbs, NULL));
//     ESP_ERROR_CHECK(adc_continuous_start(handle));

//     while (1) {

//         /**
//          * This is to show you the way to use the ADC continuous mode driver event callback.
//          * This `ulTaskNotifyTake` will block when the data processing in the task is fast.
//          * However in this example, the data processing (print) is slow, so you barely block here.
//          *
//          * Without using this event callback (to notify this task), you can still just call
//          * `adc_continuous_read()` here in a loop, with/without a certain block timeout.
//          */
//         ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

//         char unit[] = EXAMPLE_ADC_UNIT_STR(EXAMPLE_ADC_UNIT);

//         int loop_idx = 0;
//         int64_t last_time_us = esp_timer_get_time();
//         int64_t interval_us = 0;

//         while (1) {
//             ret = adc_continuous_read(handle, result, EXAMPLE_READ_LEN, &ret_num, 0);
//             if (ret == ESP_OK) {
//                 const int64_t this_time_us = esp_timer_get_time();
//                 interval_us = this_time_us - last_time_us;
//                 last_time_us = this_time_us;

//                 loop_idx += 1;
//                 if (loop_idx > 1) {
//                     loop_idx = 0;
//                     ESP_LOGI("TASK", "ret is %x, ret_num is %"PRIu32" bytes, (interval %lld us, done: %lld us)", ret, ret_num, interval_us, adc_done_interval_us);
//                     for (int i = 0; i < ret_num; i += SOC_ADC_DIGI_RESULT_BYTES) {
//                         adc_digi_output_data_t *p = (void*)&result[i];
//                         uint32_t chan_num = EXAMPLE_ADC_GET_CHANNEL(p);
//                         uint32_t data = EXAMPLE_ADC_GET_DATA(p);
//                         /* Check the channel number validation, the data is invalid if the channel num exceed the maximum channel */
//                         if (i < 50) {
//                             if (chan_num < SOC_ADC_CHANNEL_NUM(EXAMPLE_ADC_UNIT)) {
//                                 ESP_LOGI(TAG, "  -  Unit: %s, Channel: %"PRIu32", Value: %"PRIx32, unit, chan_num, data);
//                             } else {
//                                 ESP_LOGW(TAG, "  -  Invalid data [%s_%"PRIu32"_%"PRIx32"]", unit, chan_num, data);
//                             }
//                         }
//                     }
//                 }
//                 /**
//                  * Because printing is slow, so every time you call `ulTaskNotifyTake`, it will immediately return.
//                  * To avoid a task watchdog timeout, add a delay here. When you replace the way you process the data,
//                  * usually you don't need this delay (as this task will block for a while).
//                  */
//                 vTaskDelay(1);
//             } else if (ret == ESP_ERR_TIMEOUT) {
//                 //We try to read `EXAMPLE_READ_LEN` until API returns timeout, which means there's no available data
//                 break;
//                 // ESP_LOGW(TAG, "Timeout from: adc_continuous_read");
//             }
//         }

//         // vTaskDelay(pdMS_TO_TICKS(200));
//     }
//     vTaskDelete(NULL);
// }